// จงเขียนโปรแกรมสำหรับใช้เป็นหน่วยแสดงผลแบบ SevenSegmentLED ซึ่งประกอบไปด้วยขีดสั้นๆ 7 ขีด

// โดยที่เราสามารถสั่งให้แต่ละสีสว่างหรือดับได้ โดย SevenSegmentLED แสดงดังรูป


// จากตัวอย่าง เลข 8 เกิดจากการสร้างให้ขีดทั้งหมด 7 ขีดสว่าง (ตั้งแต่ขีดหมายเลข 0 ถึงขีดหมายเลข 6)

// แต่ ถ้าอยากให้หน่วยแสดงผลน้ีแสดงเป็นตัวอักษร A เราก็สั่งให้ขีดทุกขีดสว่าง ยกเว้นขีดหมายเลข 5 เป็นต้น 

// คำแนะนำ อาจเก็บข้อมูล ขีด ของ SevenSegment โดยใช้ array 2 มิติ ขนาด 3x3 (โดยให้ถือว่าอาร์เรย์ ตำแหน่ง 0,0 และ 0,2 เป็นช่องว่างเสมอ)

// อาร์เรย์ตำแหน่ง 0,1 1,1 และ 2,1 ซึ่งแทนขีดหมายเลข 0, 2 และ 5 เป็นเคร่ืองหมายขีดล่าง ‘_’ (underscore) และท่ีเหลือที่เป็นขีดแนวต้ังให้ใช้ vertical bar ‘|’

// จงเขียนโปรแกรมรับตัวเลข 7 ตัว แทนคำสั่งในการกำหนดให้แต่ละขีดสว่าง เลขแต่ละตัวมีค่าเป็นไปได้ 2 ค่า โดยที่ 1 แทนเปิด (on) และ 0 แทนปิด (off) จากนั้นแสดงเป็นตัวอักษรภาพที่ได้

// Input:
// 1 1 1 1 1 1 1

// Output:
//  _ 
// |_|
// |_|

package Lab6;
import java.util.Scanner;

public class Test10
{
    public static void main(String[] args) {
        Scanner lsa = new Scanner(System.in);
        int[] loc = new int[7];
        for(int i = 0; i < 7; i++)
        {
            loc[i] = lsa.nextInt();
        }

        char[][] display = new char[3][3];
        for(int r = 0 ; r < 3; r++)
        {
            for (int c = 0; c < 3; c++)
            {
                display[r][c] = ' ';
            }
        }
        // แถวที่ 0
        if (loc[0] == 1) display[0][1] = '_';

        // แถวที่ 1
        if (loc[1] == 1) display[1][0] = '|';
        if (loc[2] == 1) display[1][1] = '_';
        if (loc[3] == 1) display[1][2] = '|';

        // แถวที่ 2
        if (loc[4] == 1) display[2][0] = '|';
        if (loc[5] == 1) display[2][1] = '_';
        if (loc[6] == 1) display[2][2] = '|';

        for(int r = 0 ; r < 3; r++)
        {
            for (int c = 0; c < 3; c++)
            {
                System.out.print(display[r][c]);
            }
            System.out.println();
        }
        lsa.close();
    }
}
